Repository: 84000/data-translation-memory
Catalog: toh231-v1.tmx
Source language: bo
Languages: en

source: རིགས་ཀྱི་བུ་དེ་ལ་ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་རིན་པོ་ཆེའི་འབྱུང་གནས་སུ་གྱུར་པ་ཡིན་པ་ནས་ཇི་ལྟར་ན་མི་ཟད་པའི་བར་དུ་ཡིན་ཞེ་ན།
en: “You may wonder, noble son, what these qualities, from being a source of jewels through to being inexhaustible, may imply.

source: རིགས་ཀྱི་བུ་འདི་ལྟ་སྟེ། དཔེར་ན་རྒྱ་མཚོ་ཆེན་པོ་ནི་རིན་པོ་ཆེ་ཐམས་ཅད་ཀྱི་འབྱུང་གནས་ཡིན་ཏེ།
en: “Noble son, the ocean is the universal source of jewels and,

source: འཛམ་བུའི་གླིང་གི་མི་ཐམས་ཅད་ཀྱིས་རིན་པོ་ཆེ་བླང་བས་མི་ཟད་དོ།
en: even if all the humans on Jambu­dvīpa take of its treasures, it will still be inexhaustible.

source: དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའ་ཡང་ཡོན་ཏན་རིན་པོ་ཆེ་ཐམས་ཅད་ཀྱི་འབྱུང་གནས་ཡིན་ཏེ།
en: Bodhisattvas are, similarly, the universal sources of precious qualities, and

source: སེམས་ཅན་ཐམས་ཅད་ཀྱིས་ཡོན་ཏན་རིན་པོ་ཆེ་བླང་བས་མི་ཟད་དོ།
en: even if all beings take of their precious qualities, they will still be inexhaustible.

source: རིགས་ཀྱི་བུ་འདི་ལྟ་སྟེ། དཔེར་ན་རྒྱ་མཚོ་ཆེན་པོ་ནི་ཟབ་ཅིང་གཏིང་དཔག་དཀའ་བ་ཡིན་ནོ།
en: “Noble son, the ocean is deep and hard to fathom.

source: དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའ་ཡེ་ཤེས་ཡང་དག་པར་གྲུབ་པ་ཡང་ཟབ་ཅིང་སེམས་ཅན་ཐམས་ཅད་ཀྱིས་གཏིང་དཔག་དཀའ་ཞིང་ཟབ་པ་ཡིན་ནོ།
en: The bodhisattvas’ true accomplishment of wisdom is, likewise, profound and hard to fathom for sentient beings.

source: རིགས་ཀྱི་བུ་འདི་ལྟ་སྟེ། དཔེར་ན་རྒྱ་མཚོ་ཆེན་པོ་ནི་འདི་ལྟ་སྟེ། ཆུ་ཚད་མེད་པས་ན་ཡངས་ཤིང་རྒྱ་ཆེ་བ་ཡིན་ནོ།
en: “Noble son, with its infinite waters the ocean is wide and vast.

source: དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའ་ཡང་འདི་ལྟ་སྟེ། བློ་ཚད་མེད་པས་ན་ཡངས་ཤིང་རྒྱ་ཆེ་བ་ཡིན་ནོ། །
en: Being infinite, the mind of the bodhisattvas is, likewise, wide and vast.

source: རིགས་ཀྱི་བུ་འདི་ལྟ་སྟེ། དཔེར་ན་རྒྱ་མཚོ་ཆེན་པོ་ནི་བགས་ཀྱིས་གཞོལ། བགས་ཀྱིས་འབབ། བགས་ཀྱིས་བབ་བོ།
en: “Noble son, the ocean is constantly flowing, constantly streaming, and constantly moving.

source: དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའ་ཡང་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ལ་གཞོལ། ཐམས་ཅད་མཁྱེན་པ་ཉིད་ལ་འབབ། ཐམས་ཅད་མཁྱེན་པ་ཉིད་ལ་བབ་བོ།
en: Similarly, bodhisattvas are constantly flowing, constantly streaming, and constantly moving toward omniscience.

source: རིགས་ཀྱི་བུ་འདི་ལྟ་སྟེ། དཔེར་ན་རྒྱ་མཚོ་ཆེན་པོ་ནི་ཤི་བའི་རོ་དང་ལྷན་ཅིག་མི་འདུག་གོ།
en: “Noble son, the ocean does not allow a dead corpse to remain.

source: དེ་ཅིའི་ཕྱིར་ཞེ་ན། དེ་ནི་རྒྱ་མཚོ་ཆེན་པོའི་ཆོས་ཉིད་དོ།
en: Why is that? Because it is the nature of the ocean not to do so.

source: དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའ་ཡང་ཉོན་མོངས་པའི་ངོ་དང་མི་དགེ་བའི་གྲོགས་པོ་རྣམས་དང་ལྷན་ཅིག་མི་གནས་སོ།
en: Bodhisattvas, similarly, do not remain with the corpse of affliction and unvirtuous company.

source: དེ་ཅིའི་ཕྱིར་ཞེ་ན། དེ་ནི་བྱང་ཆུབ་སེམས་དཔའི་ཆོས་ཉིད་དོ།
en: Why is that? Because it is the nature of bodhisattvas not to do so.

source: རིགས་ཀྱི་བུ་འདི་ལྟ་སྟེ། དཔེར་ན་རྒྱ་མཚོ་ཆེན་པོར་ཆུ་བོ་ཇི་སྙེད་བབ་པ་དེ་དག་ཐམས་ཅད་ཀྱང་རོ་གཅིག་པ་ཡིན་ཏེ། འདི་ལྟ་སྟེ། ལན་ཚྭའི་རོའོ།
en: “Noble son, when all rivers flow into the ocean they become of the same taste, the taste of salt.

source: དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའ་ཡང་ཆོས་དཀར་པོ་རྣམས་ཇི་སྙེད་སྡུད་པ་དེ་དག་ཐམས་ཅད་རོ་གཅིག་པ་ཡིན་ཏེ། འདི་ལྟ་སྟེ། ཐམས་ཅད་མཁྱེན་པའི་རོའོ།
en: Similarly, all the virtuous qualities that bodhisattvas gather become of the same taste, the taste of omniscience.

source: རིགས་ཀྱི་བུ་འདི་ལྟ་སྟེ། དཔེར་ན་རྒྱ་མཚོ་ཆེན་པོ་ནི་ཆུ་བོ་ཚད་མེད་པ་ཀུན་ཟེད་ཀྱང་དེ་ལ་བྲི་བའམ། གང་བར་ཡང་མི་མངོན་ནོ།
en: “Noble son, innumerable rivers may flow into the ocean without it ever decreasing or increasing.

source: དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའ་ཡང་ཆོས་ཀྱི་ཆུ་བོ་ཚད་མེད་པ་ཀུན་ཟེད་ཀྱང་དེ་ལ་བྲི་བའམ། གང་བར་མི་མངོན་ནོ།
en: Similarly, innumerable Dharma rivers may flow into bodhisattvas without them ever decreasing or increasing.

source: རིགས་ཀྱི་བུ་འདི་ལྟ་སྟེ། དཔེར་ན་རྒྱ་མཚོ་ཆེན་པོ་ནི་དུས་ལས་མི་ཡོལ་ལོ།
en: “Noble son, the ocean is never late.

source: དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའ་ཡང་གདུལ་བར་བྱ་བའི་སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱ་བའི་དུས་ལས་མི་ཡོལ་ལོ།
en: Bodhisattvas, similarly, are never late when it comes to ripening sentient beings who are to be trained.

source: རིགས་ཀྱི་བུ་འདི་ལྟ་སྟེ། དཔེར་ན་རྒྱ་མཚོ་ཆེན་པོ་ནི་འབྱུང་པོ་མང་པོའི་གནས་སོ།
en: “Noble son, the ocean is the abode of numerous spirits.

source: དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའ་ཡང་སེམས་ཅན་ཐམས་ཅད་དང་། ཆོས་དཀར་པོ་ཐམས་ཅད་ཀྱི་གནས་སོ།
en: Bodhisattvas, similarly, are the abode of all sentient beings and all virtuous qualities.

source: རིགས་ཀྱི་བུ་འདི་ལྟ་སྟེ། དཔེར་ན་རྒྱ་མཚོ་ཆེན་པོ་ནི་སེམས་ཅན་ཐམས་ཅད་ཀྱིས་ཆུ་བཅུས་ཀྱང་མི་ཟད་པ་ཡིན་ནོ།
en: “Noble son, the water of the ocean does not become exhausted even if all sentient beings partake of it.

source: དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའ་ཡང་སེམས་ཅན་ཐམས་ཅད་ལ་ཆོས་སྟོན་པ་མི་ཟད་པ་ཡིན་ཏེ།
en: The Dharma teaching of bodhisattvas, similarly, is inexhaustible even if it is given to all sentient beings.

source: རིགས་ཀྱི་བུ་དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་རིན་པོ་ཆེའི་འབྱུང་གནས་སུ་གྱུར་པ་ནས་མི་ཟད་པའི་བར་དུ་ཡིན་ནོ།
en: “Noble son, from being the source of jewels through to inexhaustibility, this is how bodhisattvas are.

source: རིགས་ཀྱི་བུ་ཆོས་བཅུ་པོ་དེ་དག་དང་ལྡན་ན་བྱང་ཆུབ་སེམས་དཔའ་བློ་རྒྱ་མཚོ་དང་མཚུངས་པ་རྣམས་ཡིན་ནོ།
en: Noble son, when they possess ten such qualities the minds of bodhisattvas are like the ocean.

source: རིགས་ཀྱི་བུ་ཆོས་བཅུ་དང་ལྡན་ན་བྱང་ཆུབ་སེམས་དཔའ་བློ་ཞིབ་པ་རྣམས་ཡིན་ནོ།
en: “Noble son, because they are endowed with ten qualities bodhisattvas possess a subtle intellect.

source: བཅུ་གང་ཞེ་ན། འདི་ལྟ་སྟེ། འབྱུང་བ་ཚོལ་བ་ལ་མཁས་པ་རྣམས་ཡིན། ཆོས་ཐམས་ཅད་བརྟག་པ་ལ་མཁས་པ་རྣམས་ཡིན། ཆོས་ཐམས་ཅད་ཀྱི་མཉམ་པ་ཉིད་ཁོང་དུ་ཆུད་པ་རྣམས་ཡིན། ཆོས་ཐམས་ཅད་སྒྱུ་མའི་མཚན་ཉིད་དུ་ཁོང་དུ་ཆུད་པ་རྣམས་ཡིན། ཆོས་ཐམས་ཅད་ཡོངས་སུ་ཤེས་པ་ལ་མཁས་པ་རྣམས་ཡིན། རྟེན་ཅིང་འབྲེལ་བར་འབྱུང་བ་ཟབ་ཅིང་གཏིང་དཔག་དཀའ་བ་ལ་མཁས་པ་རྣམས་ཡིན། ལས་བསམ་གྱིས་མི་ཁྱབ་པ་ལ་མཁས་པ་རྣམས་ཡིན། སྨྲས་པའི་དོན་ཤེས་པ་རྣམས་ཡིན། དོན་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་རྟོགས་པ་རྣམས་ཡིན། དེ་ཁོ་ན་ལ་མཁས་པ་རྣམས་ཡིན་ནོ།
en: What are those ten? They are expertise in investigating origination, expertise in examining all phenomena, comprehension of the sameness of all phenomena, comprehension that all phenomena are characterized by illusion, expertise in the knowledge of all phenomena, expertise in the profound dependent origination that is hard to fathom, expertise regarding inconceivable karmic action, knowledge of the meaning taught, full realization of the exact meaning, and expertise concerning reality.

source: རིགས་ཀྱི་བུ་དེ་ལ་ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་འབྱུང་བ་ཚོལ་བ་ལ་མཁས་པ་ཡིན་པ་ནས་ཇི་ལྟར་ན་དེ་ཁོ་ན་ལ་མཁས་པའི་བར་དུ་ཡིན་ཞེ་ན།
en: “You may wonder, noble son, what these qualities, from expertise in investigating origination up through expertise concerning reality, may imply.

source: ཀྱེ་མའོ་འཇིག་རྟེན་གནས་པ་འདི་ནི་འདི་ལྟ་སྟེ། འདོད་ཆགས་ཀྱི་མེས་ཀུན་ཏུ་འབར་རོ།
en: ‘Alas, those who remain in the world are ablaze with the fire of desire.

source: རབ་ཏུ་འབར་རོ། །ཀུན་ཏུ་རབ་ཏུ་མཆེད་ཅིང་འབར་རོ།
en: Engulfed by fire, they burn with great flames.

source: ཀྱེ་མའོ་འཇིག་རྟེན་གནས་པ་འདི་ནི་འདི་ལྟ་སྟེ། ཞེ་སྡང་གི་དུ་བ་འཁྲིགས་པའི་དུ་བ་འཚུབས་པས་རྣམ་པར་རྨོངས་སོ།
en: Alas, those who remain in the world are bewildered by the distressful storm clouds of anger.

source: ཀྱེ་མའོ་འཇིག་རྟེན་གནས་པ་འདི་ནི་འདི་ལྟ་སྟེ། གཏི་མུག་གི་མུན་པས་མུན་ནག་ཏུ་གྱུར་ཏོ་
en: Alas, those who remain in the world are obscured by the black darkness of ignorance.’

source: སྙམ་མོ། །དེ་འདི་ལྟར་སེམས་ཅན་འདི་དག་ཇི་ལྟར་འབྱུང་བར་འགྱུར་སྙམ་སེམས་ཏེ།
en: Thinking in this way, they wonder how such beings emerge.

source: དེ་དེ་དག་གི་འབྱུང་བ་ཡོངས་སུ་ཚོལ་ཞིང་ཆོས་ཐམས་ཅད་ལ་རྟོག་གོ།
en: “As they investigate the origin of sentient beings they examine all phenomena.

source: ཆོས་ཐམས་ཅད་ལ་རྟོག་པས་ཆོས་ཐམས་ཅད་ཀྱི་མཉམ་པ་ཉིད་ཁོང་དུ་ཆུད་པར་འགྱུར་རོ།
en: As they examine all phenomena they comprehend the sameness of all phenomena.

source: ཆོས་ཐམས་ཅད་ཀྱི་མཉམ་པ་ཉིད་ཁོང་དུ་ཆུད་པས་ཆོས་ཐམས་ཅད་སྒྱུ་མའི་མཚན་ཉིད་དུ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་རབ་ཏུ་ཤེས་སོ།
en: Comprehending the sameness of all phenomena they gain an exact understanding of the way all phenomena are characterized by illusion.

source: ཆོས་རྣམས་སྒྱུ་མའི་མཚན་ཉིད་དུ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་ཤེས་པས་ཆོས་ཐམས་ཅད་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་རབ་ཏུ་ཤེས་སོ།
en: Having understood exactly how all phenomena are characterized by illusion, they genuinely and correctly comprehend all phenomena.

source: ཆོས་ཐམས་ཅད་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་ཡོངས་སུ་ཤེས་པས་རྟེན་ཅིང་འབྲེལ་པར་འབྱུང་བ་ཟབ་མོ་ལ་རྣམ་པར་སེམས་སོ།
en: With a genuine and correct knowledge of all phenomena their minds turn to profound dependent origination.

source: དེ་རྟེན་ཅིང་འབྲེལ་པར་འབྱུང་བ་ཟབ་མོ་ལ་རྣམ་པར་སེམས་པས་ལས་བསམ་གྱིས་མི་ཁྱབ་པ་ལ་རྣམ་པར་རྟོག་སྟེ།
en: As their minds are concerned with profound dependent origination they examine inconceivable karmic action.

source: དེ་འདི་སྙམ་དུ་དངོས་པོ་མེད་པའི་ཆོས་རྣམས་ལ་ལས་སྣ་ཚོགས་སྣང་བ་ནི་ངོ་མཚར་ཏོ་སྙམ་དུ་སེམས་སོ།
en: Thus they think, ‘How amazing that while phenomena are not real, all sorts of actions appear.’

source: དེ་ལྟར་དེ་བློ་ཞིབ་མོ་དང་ལྡན་པས་སངས་རྒྱས་རྣམས་སམ། བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱིས་གསུངས་པ་ཙམ་གྱིས་དོན་ཤེས་སོ།
en: Endowed with such subtle intellect, they understand the meaning of what the buddhas and bodhisattvas teach, simply by hearing it.

source: དེས་དོན་ཤེས་པས་དོན་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་རབ་ཏུ་རྟོགས་སོ།
en: With such understanding of the meaning they realize the meaning genuinely and correctly.

source: དོན་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་རབ་ཏུ་རྟོགས་པས་དེ་ཁོ་ན་མཐོང་ངོ་།
en: With a genuine and correct realization of the meaning they see reality.

source: དེ་ཁོ་ན་མཐོང་བས་སེམས་ཅན་རྣམས་འཁོར་བའི་བཙོན་ར་ནས་ཐར་བར་བྱེད་དེ།
en: When they see reality, they can free sentient beings from the prison of cyclic existence.

source: རིགས་ཀྱི་བུ་དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་འབྱུང་བ་ཚོལ་བ་ལ་མཁས་པ་ནས། དེ་ཁོ་ན་ལ་མཁས་པའི་བར་དུ་ཡིན་ནོ།
en: “Noble son, from expertise in investigating origination up through expertise concerning reality, this is how bodhisattvas are.

source: རིགས་ཀྱི་བུ་ཆོས་བཅུ་པོ་དེ་དག་དང་ལྡན་ན་བྱང་ཆུབ་སེམས་དཔའ་བློ་ཞིབ་པ་རྣམས་ཡིན་ནོ།
en: Noble son, when endowed with these ten qualities bodhisattvas are endowed with subtle intellect.

source: རིགས་ཀྱི་བུ་ཆོས་བཅུ་དང་ལྡན་ན་བྱང་ཆུབ་སེམས་དཔའ་རིགས་པའི་སྤོབས་པ་ཅན་རྣམས་ཡིན་ནོ།
en: “Noble son, because they are endowed with ten qualities bodhisattvas possess a coherent eloquence.

source: ཆོས་ཐམས་ཅད་བདག་མེད་པར་འཇོག་གོ།
en: engagement with the absence of self that pertains to all phenomena,

source: སེམས་ཅན་མེད་པ་དང་། སྲོག་མེད་པ་དང་། གསོ་བ་མེད་པ་དང་། གང་ཟག་མེད་པ་དང་། བྱེད་པ་པོ་དང་ཚོར་བ་པོ་མེད་པ་དང་། ཤེས་པ་པོ་དང་མཐོང་བ་པོ་མེད་པ་དང་། གསོག་གསོབ་སྟེ་
en: engagements with the absence of a sentient being, a life force, an individual, a person, an agent and a sensor, and a knower and a seer;

source: དབང་ཕྱུག་མེད་པ་དང་། སྟོང་པ་ཡང་དག་པ་མ་ཡིན་པ་ལས་ཡོངས་སུ་བརྟགས་པ་དང་། རྐྱེན་ལས་བྱུང་བར་འཇོག་སྟེ།
en: analysis of the voidness and absence of a ruler; analysis based on the empty and unreal; and engagement with conditioned occurrence.

source: རིགས་ཀྱི་བུ་དེ་ལ་ཆོས་ཐམས་ཅད་བདག་མེད་པ་ཞེས་བྱ་བ་འདི་ནི་རིགས་པའོ། །འདི་ནི་ཆོས་ཉིད་དང་འཐུན་པའོ།
en: Noble son, the statement that all phenomena are devoid of self is rational and in accord with the intrinsic nature.

source: ཆོས་ཐམས་ཅད་སེམས་ཅན་མེད་པ་སྲོག་མེད་པ་ཞེས་བྱ་བ་འདི་ནི་རིགས་པའོ།
en: The statement that all phenomena are devoid of a sentient being and a life force is rational.

source: འདི་ནི་ཆོས་ཉིད་དང་འཐུན་པའོ།
en: It is a statement that is in accord with the intrinsic nature.

source: དེ་བཞིན་དུ་ཆོས་ཐམས་ཅད་གསོ་བ་མེད་པ་དང་། གང་ཟག་མེད་པ་དང་། བྱེད་པ་པོ་དང་། ཚོར་བ་པོ་མེད་པ་དང་། ཤེས་པ་པོ་དང་མཐོང་བ་པོ་མེད་པ་དང་། གསོག་གསོབ་སྟེ་དབང་ཕྱུག་མེད་པ་དང་། སྟོང་པ་ཡང་དག་པ་མ་ཡིན་པ་ལས་ཡོངས་སུ་བརྟགས་པ་དང་། རྐྱེན་ལས་བྱུང་བའོ་ཞེས་བྱ་བ་འདི་ནི་རིགས་པའོ།
en: Likewise, rational are the statements that there is no individual, no person, no agent and no sensor, and no knower and no seer, and rational also is the analysis of the voidness and absence of any ruler, the analysis based on the empty and unreal, and the engagement with conditioned occurrence.

source: རིགས་ཀྱི་བུ་གང་ཆོས་ཉིད་དང་འཐུན་པ་དེ་ནི་རིགས་པའོ།
en: Noble son, that which accords with the intrinsic nature is rational.

source: གང་ཆོས་ཉིད་དང་མི་འགལ་བ་དེ་ནི་རིགས་པའོ།
en: Whatever does not conflict with the intrinsic nature is rational.

source: གང་ཆོས་ཉིད་ལས་མི་འཁྲུལ་བ་དེ་ནི་རིགས་པའོ།
en: Whatever is not a distortion of the intrinsic nature is rational.

source: གང་ཆོས་ཉིད་ལ་འབབ་པ་དེ་ནི་རིགས་པའོ།
en: That which leads to the intrinsic nature is rational.

source: གང་ཆོས་ཉིད་སྟོན་པ་དེ་ནི་རིགས་པའོ།
en: That which reveals the intrinsic nature is rational.

source: དེ་ཡང་དེ་དག་ལ་སྤོབས་པས་ན་དེའི་ཕྱིར་རིགས་པར་སྤོབས་པ་རྣམས་ཞེས་བྱའོ།
en: Since they have eloquence regarding these matters, bodhisattvas are said to have coherent eloquence.

source: རིགས་ཀྱི་བུ་ཆོས་བཅུ་པོ་དེ་དག་དང་ལྡན་ན་བྱང་ཆུབ་སེམས་དཔའ་རིགས་པའི་སྤོབས་པ་ཅན་རྣམས་ཡིན་ནོ།
en: Noble son, bodhisattvas endowed with these ten qualities possess a coherent eloquence.

source: རིགས་ཀྱི་བུ་ཆོས་བཅུ་དང་ལྡན་ན་བྱང་ཆུབ་སེམས་དཔའ་གྲོལ་བའི་སྤོབས་པ་ཅན་རྣམས་ཡིན་ནོ།
en: “Noble son, because they possess ten qualities bodhisattvas have a fluent eloquence.

source: བཅུ་གང་ཞེ་ན། འདི་ལྟ་སྟེ། སྤོབས་པ་ཐོགས་པ་མེད་པ་རྣམས་ཡིན། སྤོབས་པ་རྒྱུན་ཆགས་པ་རྣམས་ཡིན། སྤོབས་པ་མི་ཟད་པ་རྣམས་ཡིན། སྤོབས་པ་མི་བརྟབས་པ་རྣམས་ཡིན། སྤོབས་པ་མ་ཞུམ་པ་རྣམས་ཡིན། སྤོབས་པ་མི་སྐྲག་པ་རྣམས་ཡིན། སྤོབས་པ་ཕལ་ལ་མེད་པ་རྣམས་ཡིན། སྤོབས་པ་ཟིལ་གྱིས་མ་ནོན་པ་རྣམས་ཡིན། སྤོབས་པ་མཐའ་ཡས་པ་རྣམས་ཡིན། སོ་སོ་ཡང་དག་པར་རིག་པ་ཐོབ་པའི་སྤོབས་པ་ཅན་རྣམས་ཡིན་ཏེ།
en: What are those ten? They are unimpeded eloquence, continuous eloquence, inexhaustible eloquence, undaunted eloquence, undeterred eloquence, fearless eloquence, extraordinary eloquence, indomitable eloquence, infinite eloquence, and eloquence through the attainment of correct understanding.

source: རིགས་ཀྱི་བུ་ཆོས་བཅུ་པོ་དེ་དག་དང་ལྡན་ན་བྱང་ཆུབ་སེམས་དཔའ་གྲོལ་བའི་སྤོབས་པ་ཅན་རྣམས་ཡིན་ནོ།
en: Noble son, bodhisattvas endowed with these ten qualities have a fluent eloquence.

source: རིགས་ཀྱི་བུ་ཆོས་བཅུ་དང་ལྡན་ན་བྱང་ཆུབ་སེམས་དཔའ་རྣམ་པར་དག་པའི་སྤོབས་པ་ཅན་རྣམས་ཡིན་ནོ།
en: “Noble son, bodhisattvas endowed with ten qualities have pure eloquence.

source: བཅུ་གང་ཞེ་ན། འདི་ལྟ་སྟེ། འདར་འདར་པོ་མེད་པའི་སྤོབས་པ་ཅན་རྣམས་ཡིན། མི་འཁྲུལ་པའི་སྤོབས་པ་ཅན་རྣམས་ཡིན། མི་ཞན་པའི་སྤོབས་པ་ཅན་རྣམས་ཡིན། ཡེང་ཡེང་པོ་མེད་པའི་སྤོབས་པ་ཅན་རྣམས་ཡིན། དེ་དག་གི་སྤོབས་པ་དོན་དང་བྲལ་བ་མ་ཡིན།
en: What are those ten? They include eloquence free of quivering, eloquence free of delusion, eloquence free of inadequacies, as well as undistracted eloquence.

source: ཚིག་འབྲུ་དང་བྲལ་བ་མ་ཡིན། སྦྱོར་བ་དང་བྲལ་བ་མ་ཡིན། དུས་དང་བྲལ་བ་མ་ཡིན།
en: Such types of eloquence are, moreover, neither lacking in terms of meaning, words, proofs, nor timeliness.

source: རྩུབ་པ་མ་ཡིན། མི་གསལ་བའི་སྤོབས་པ་ཅན་མ་ཡིན་ནོ།
en: They are neither harsh nor unclear.

source: རིགས་ཀྱི་བུ་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་སྤོབས་པ་ནི་འདར་འདར་པོ་མ་ཡིན་ནོ།
en: “Noble son, the eloquence of bodhisattvas is free of quivering.

source: དེ་ཅིའི་ཕྱིར་ཞེ་ན། འཁོར་གྱི་འཇིགས་པའི་བག་ཚ་བ་དང་བྲལ་བའི་ཕྱིར་རོ།
en: How so? Because bodhisattvas are free from anxieties when in the midst of a gathering.

source: བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་སྤོབས་པ་ནི་འཁྲུལ་པ་མ་ཡིན་ནོ།
en: “The eloquence of bodhisattvas is free of delusion.

source: དེ་ཅིའི་ཕྱིར་ཞེ་ན། བློ་བརྟན་ཞིང་མི་འགྱུར་བའི་ཕྱིར་རོ།
en: How so? Because their minds are stable and unchanging.

source: བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་སྤོབས་པ་ནི་ཞན་པ་མ་ཡིན་ནོ།
en: “The eloquence of bodhisattvas is free of inadequacies.

source: དེ་ཅིའི་ཕྱིར་ཞེ་ན། འཇིགས་པ་མེད་པའི་ཕྱིར་ཏེ།
en: How so? Because bodhisattvas are fearless.

source: རིགས་ཀྱི་བུ་བྱང་ཆུབ་སེམས་དཔའ་ནི་འཁོར་གྱི་ནང་དུ་ཕྱིན་ན་མི་འཇིགས་མི་སྐྲག་སྟེ།
en: Noble son, when bodhisattvas step into the center of a gathering they are free of fears and anxieties.

source: སེང་གེ་ལྟར་འཇིགས་པ་མེད་ཅིང་མི་སྐྲག་མི་དངངས་པ་ཡིན་ནོ།
en: Like lions, they are unafraid, fearless, and undisturbed.

source: བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་སྤོབས་པ་ནི་ཡེང་ཡེང་པོ་མེད་པ་ཡིན་ནོ།
en: “The eloquence of bodhisattvas is undistracted.

source: དེ་ཅིའི་ཕྱིར་ཞེ་ན། ཉོན་མོངས་པ་དང་བྲལ་བའི་ཕྱིར་རོ།
en: How so? Because they are free of afflictions.

source: རིགས་ཀྱི་བུ་ཉོན་མོངས་པ་དང་བཅས་པའི་སྤོབས་པ་ནི་ཡེང་ཡེང་པོར་འགྱུར་བ་ཡིན་ཏེ། ཉོན་མོངས་པ་མེད་པའི་ནི་མ་ཡིན་ནོ།
en: Noble son, whereas afflicted eloquence is distracted, that is not so when it is free of afflictions.

source: བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་སྤོབས་པ་ནི་དོན་དང་བྲལ་བ་མ་ཡིན་ནོ།
en: “The eloquence of bodhisattvas is not lacking in terms of meaning.

source: དེ་ཅིའི་ཕྱིར་ཞེ་ན། ཆོས་ཉིད་ཐོབ་པའི་ཕྱིར་ཏེ།
en: How so? Because they have attained the intrinsic nature.

source: རིགས་ཀྱི་བུ་ཆོས་ཉིད་མ་ཐོབ་པ་རྣམས་ཀྱི་ནི་དོན་དང་བྲལ་བར་འགྱུར་གྱི། ཆོས་ཉིད་ཐོབ་པ་རྣམས་ཀྱི་ནི་མ་ཡིན་ནོ།
en: Noble son, lack of meaning concerns those who have not accomplished the intrinsic nature, not those who have.

source: བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་སྤོབས་པ་ནི་ཚིག་འབྲུ་དང་བྲལ་བ་མ་ཡིན་ནོ།
en: “The eloquence of bodhisattvas is not short of words.

source: དེ་ཅིའི་ཕྱིར་ཞེ་ན། གཙུག་ལག་ཐམས་ཅད་ལ་འཇིགས་པ་མེད་པའི་ཕྱིར་ཏེ།
en: How so? Because bodhisattvas are unintimidated with respect to any of the fields of learning.

source: རིགས་ཀྱི་བུ་གཙུག་ལག་གི་ཕྱོགས་འགའ་ཤེས་པ་རྣམས་ཀྱི་ནི་ཚིག་འབྲུ་དང་བྲལ་བར་འགྱུར་གྱི།
en: Noble son, those who possess knowledge of only certain fields of learning may run out of words. Yet

source: གཙུག་ལག་ཐམས་ཅད་ལ་འཇིགས་པ་མེད་པ་རྣམས་ཀྱི་ནི་མ་ཡིན་ནོ།
en: that is not the case with those who are not intimidated by any field of learning.

source: བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་སྤོབས་པ་ནི་སྦྱོར་བ་དང་བྲལ་བ་མ་ཡིན་ནོ།
en: “The eloquence of bodhisattvas is not lacking in terms of proofs.

source: དེ་ཅིའི་ཕྱིར་ཞེ་ན། སྦྱོར་བ་ཐམས་ཅད་ཡང་དག་པར་བསྒྲུབས་པའི་ཕྱིར་ཏེ།
en: How so? Because they establish all proofs correctly.

source: རིགས་ཀྱི་བུ་སྦྱོར་བ་ལ་མི་མཁས་པ་རྣམས་ཀྱི་ནི་སྦྱོར་བ་དང་བྲལ་བར་འགྱུར་གྱི། སྦྱོར་བ་མཐའ་ཡས་པ་དང་ལྡན་པ་རྣམས་ཀྱི་ནི་མ་ཡིན་ནོ།
en: Noble son, those who lack logical reasoning will fail to establish proofs, but not those who possess infinite proofs.

source: བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་སྤོབས་པ་ནི་གང་ཕྱིས་སྨྲ་བར་བྱ་བ་དེ་སྔར་སྨྲ་བའམ། གང་སྔར་སྨྲ་བར་བྱ་བ་དེ་ཕྱིས་སྨྲ་བ་ལྟ་བུར་དུས་དང་བྲལ་བ་མ་ཡིན་ནོ།
en: “The eloquence of bodhisattvas is timely, in the sense that they avoid saying too early what should be said later, or saying too late what should have been said earlier.

source: དེ་ཅིའི་ཕྱིར་ཞེ་ན། བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ནི་དུས་ཤེས་པ་ཡིན། ཚོད་ཤེས་པ་ཡིན། སྐབས་ཤེས་པ་ཡིན་ནོ།
en: How so? Because they know the time and limits, and they remain aware of the situation.

source: བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་སྤོབས་པ་ནི་རྩུབ་པ། ཡིད་དུ་མི་འོང་བ། མི་སྙན་པ་མ་ཡིན་ནོ།
en: “The eloquence of bodhisattvas is not harsh, being neither unpleasant to the mind nor to the ear.

source: དེ་ཅིའི་ཕྱིར་ཞེ་ན། ངག་གི་གནས་ངན་ལེན་དང་བྲལ་བའི་ཕྱིར་ཏེ།
en: How so? Because it is free of all negative tendencies of speech.

source: རིགས་ཀྱི་བུ་གནས་ངན་ལེན་དང་བཅས་པ་རྣམས་ཀྱི་སྤོབས་པ་ནི་རྩུབ་པ་ཡིན་གྱི། གནས་ངན་ལེན་དང་བྲལ་བ་རྣམས་ཀྱི་ནི་མ་ཡིན་ནོ།
en: Noble son, the eloquence of those who have negative tendencies may be harsh, yet that is not the case with those who are free of negative tendencies.

source: བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་སྤོབས་པ་ནི་མི་གསལ་བ་མ་ཡིན་ཏེ།
en: “The eloquence of bodhisattvas is not unclear.

source: དེ་ཅིའི་ཕྱིར་ཞེ་ན། དབང་པོ་རྣོ་བའི་ཕྱིར་རོ།
en: How so? Because they have sharp faculties.

source: རིགས་ཀྱི་བུ་དབང་པོ་རྟུལ་པོ་རྣམས་ཀྱི་སྤོབས་པ་ནི་མི་གསལ་བ་ཡིན་གྱི། དབང་པོ་རྣོན་པོ་རྣམས་ཀྱི་ནི་མ་ཡིན་ཏེ།
en: Noble son, the eloquence of those with dull faculties may suffer from a lack of clarity, yet that is not the case with those whose faculties are sharp.

source: རིགས་ཀྱི་བུ་ཆོས་བཅུ་པོ་དེ་དག་དང་ལྡན་ན་བྱང་ཆུབ་སེམས་དཔའ་རྣམ་པར་དག་པའི་སྤོབས་པ་ཅན་རྣམས་ཡིན་ནོ།
en: “Noble son, possessing these ten qualities bodhisattvas are endowed with pure eloquence.

source: རིགས་ཀྱི་བུ་ཆོས་བཅུ་དང་ལྡན་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་ཅན་ཐམས་ཅད་མགུ་བར་བྱེད་པའི་སྤོབས་པ་ཅན་རྣམས་ཡིན་ནོ།
en: “Noble son, bodhisattvas who possess ten qualities have an eloquence that brings everyone joy.

source: བཅུ་གང་ཞེ་ན། འདི་ལྟ་སྟེ། འཇམ་པར་སྨྲ་བ་རྣམས་ཡིན། བཞིན་འཛུམ་ཞིང་ཁྲོ་གཉེར་མེད་པ་རྣམས་ཡིན། དོན་དུ་སྨྲ་བ་རྣམས་ཡིན། ཆོས་སུ་སྨྲ་བ་རྣམས་ཡིན། མཚུངས་པར་སྨྲ་བ་རྣམས་ཡིན། མི་ངོམས་པ་རྣམས་ཡིན། བརྙས་པ་དང་བྲལ་བ་རྣམས་ཡིན། ཉོན་མོངས་པར་འགྱུར་བ་མེད་པ་རྣམས་ཡིན། འཁྲུག་པ་མེད་པ་རྣམས་ཡིན། སྤོབས་པ་སྣ་ཚོགས་པ་རྣམས་ཡིན་ནོ།
en: What are those ten? They are gentle speech, a radiant smile without angry frowning, speaking meaningfully, speaking the Dharma, teaching equally, not showing off, being flawless, being unafflicted, being free of hostility, and possessing a diverse eloquence.

source: རིགས་ཀྱི་བུ་བྱང་ཆུབ་སེམས་དཔའ་འཇམ་པར་སྨྲ་བ་ནི།
en: “Noble son, bodhisattvas speak gently.

source: འཇམ་པར་སྨྲ་བས་སེམས་ཅན་རྣམས་མགུ་བར་བྱེད་དོ།
en: Their gentle speech gives joy to beings.

source: བྱང་ཆུབ་སེམས་དཔའ་ནི་བཞིན་འཛུམ་ཞིང་ཁྲོ་གཉེར་མེད་པ་ཡིན་ཏེ།
en: Bodhisattvas smile and do not frown in anger.

source: མདངས་བཟང་པོས་སེམས་ཅན་རྣམས་མགུ་བར་བྱེད་དོ།
en: Their radiant countenance gives joy to sentient beings.

source: བྱང་ཆུབ་སེམས་དཔའ་དོན་དུ་སྨྲ་བ་ནི་ཚིག་རན་པས་སེམས་ཅན་རྣམས་མགུ་བར་བྱེད་དོ།
en: Bodhisattvas speak what is meaningful. Their measured words bring joy to sentient beings.

source: བྱང་ཆུབ་སེམས་དཔའ་ཆོས་སུ་སྨྲ་བ་ནི་ཕན་པར་སྨྲ་བས་སེམས་ཅན་རྣམས་མགུ་བར་བྱེད་དོ།
en: Bodhisattvas speak the Dharma. Their beneficial words bring joy to sentient beings.

source: བྱང་ཆུབ་སེམས་དཔའ་མཚུངས་པར་སྨྲ་བ་ནི་སེམས་ཅན་ཐམས་ཅད་ལ་མཚུངས་པར་ཆོས་སྟོན་པས་སེམས་ཅན་རྣམས་མགུ་བར་བྱེད་དོ།
en: The teaching of bodhisattvas is equal. Teaching the Dharma equally to everyone, they bring joy to sentient beings.

source: བྱང་ཆུབ་སེམས་དཔའ་མི་ངོམས་པ་ནི་ང་རྒྱལ་དང་དྲེགས་པ་དང་རྒྱགས་པ་དང་བྲལ་ཞིང་སྤྱོད་པ་མཚུངས་པས་སེམས་ཅན་རྣམས་མགུ་བར་བྱེད་དོ།
en: Bodhisattvas do not show off. Free of pride, conceit, and arrogance, they act accordingly and bring joy to sentient beings.

source: བྱང་ཆུབ་སེམས་དཔའ་བརྙས་པ་དང་བྲལ་བ་ནི་རི་མོར་བྱས་ཤིང་ཆོས་བསྟན་པས་སེམས་ཅན་རྣམས་མགུ་བར་བྱེད་དོ།
en: Bodhisattvas are flawless. With respect and the teaching of Dharma they bring joy to sentient beings.

source: བྱང་ཆུབ་སེམས་དཔའ་ཉོན་མོངས་པར་འགྱུར་བ་མེད་པ་ནི་ངང་ཚུལ་དེས་པས་སེམས་ཅན་རྣམས་མགུ་བར་བྱེད་དོ།
en: Bodhisattvas are not afflicted. With their dependable character they bring joy to sentient beings.

source: བྱང་ཆུབ་སེམས་དཔའ་འཁྲུག་པ་མེད་པ་ནི་བཟོད་པ་མང་བས་སེམས་ཅན་རྣམས་མགུ་བར་བྱེད་དོ།
en: Bodhisattvas are free from strife. With abundant patience they bring joy to sentient beings.

source: རིགས་ཀྱི་བུ་བྱང་ཆུབ་སེམས་དཔའ་སྤོབས་པ་སྣ་ཚོགས་ཅན་ནི་དགའ་བའི་ཚིག་གིས་སེམས་ཅན་རྣམས་མགུ་བར་བྱེད་དོ།
en: Noble son, the eloquence of bodhisattvas is diverse. With delightful speech they bring joy to sentient beings.

source: རིགས་ཀྱི་བུ་ཆོས་བཅུ་པོ་དེ་དག་དང་ལྡན་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་ཅན་ཐམས་ཅད་མགུ་བར་བྱེད་པའི་སྤོབས་པ་ཅན་རྣམས་ཡིན་ནོ།
en: Noble son, endowed with ten such qualities bodhisattvas have an eloquence that brings everyone joy.

source: རིགས་ཀྱི་བུ་ཆོས་བཅུ་དང་ལྡན་ན་བྱང་ཆུབ་སེམས་དཔའ་ཚིག་གཟུང་བར་འགྱུར་བ་རྣམས་ཡིན་ནོ།
en: “Noble son, bodhisattvas possessing ten qualities will have their words accepted.

source: བྱང་ཆུབ་སེམས་དཔའ་རྣམས་སྣོད་དུ་མ་གྱུར་པའི་སེམས་ཅན་རྣམས་ལ་ཆོས་མི་སྟོན་ཏེ།
en: Bodhisattvas do not teach the Dharma to those who are not ready to receive it.

source: ཞེ་འགྲས་པ་རྣམས་ལ་མ་ཡིན། ཀླན་ཀ་ཚོལ་བ་རྣམས་ལ་མ་ཡིན།
en: Thus, they do not teach those who are hateful and blame others.

source: མུ་སྟེགས་ཅན་རྣམས་ལ་མ་ཡིན། རི་མོ་མེད་པ་རྣམས་ལ་མ་ཡིན། མ་དད་པ་མང་བ་རྣམས་ལ་མ་ཡིན། གཡོ་དང་སྒྱུས་གླགས་པ་རྣམས་ལ་མ་ཡིན།
en: They do not teach non-Buddhists, the disrespectful, those lacking faith, or the deceitful and dishonest.

source: འཚོ་བའི་བསམ་པ་ཅན་རྣམས་ལ་མ་ཡིན། རྙེད་པ་དང་། བཀུར་སྟི་དང་། ཕྲག་དོག་དང་། སེར་སྣས་གླགས་པ་རྣམས་ལ་མ་ཡིན།
en: They do not teach those looking for a livelihood, or those motivated by wealth, honor, envy, or stinginess.

source: སེམས་ཅན་གླེན་པ་རྨོངས་པ་ལུག་ལྟར་ལྐུགས་པའི་རང་བཞིན་ཅན་རྣམས་ལ་ཆོས་མི་སྟོན་ཏེ།
en: Neither do they teach the Dharma to dull, obscured, or sheepishly dumb beings.

source: རིགས་ཀྱི་བུ་དེ་ཅིའི་ཕྱིར་ཞེ་ན། བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ལ་ཆོས་ཀྱི་སེར་སྣ་ཡང་མེད།
en: Noble son, you may wonder why that is. It is of course not that bodhisattvas are stingy with the Dharma,
